Autodesk.Revit.DB.Curve.Intersect(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.CurveIntersectResultOption)
Calculates the intersection of this curve with the specified curve.
Calculates the intersection of this curve with the specified curve.
Since:  2026
curve: The specified curve to intersect with this curve.
option: Specifies the amount of information to return in the Autodesk.Revit.DB.CurveIntersectResult.
Returns: The Autodesk.Revit.DB.CurveIntersectResult describing the geometric relationship of the two curves. This will contain at least a SetComparisonResult and, if requested,
a list of Autodesk.Revit.DB.CurveOverlapPoints specifying where the two curves overlap or intersect.
Remarks:
The Autodesk.Revit.DB.CurveIntersectResultOption passed to this method determines the amount of information that will be calculated and returned:
CurveIntersectResultOption.Simple - Calculate only the geometric relationship between the two curves, as indicated by a SetComparisonResult value.CurveIntersectResultOption.Detailed - Calculate the geometric relationship between the two curves, along with any points or intervals of overlap.
This option may result in additional computations being performed compared to CurveIntersectResultOption.Simple.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
The specified curve is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to calculate the intersection.